Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_device.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H747_CM7_otg2_hs_device.
; =============================

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32H747_CM7_otg2_hs_device equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

#include	<stdint.h>

// OTG2_HS_DEVICE address definitions
// ----------------------------------

typedef struct {
	volatile	uint32_t	OTG_HS_DCFG;
	volatile	uint32_t	OTG_HS_DCTL;
	volatile	uint32_t	OTG_HS_DSTS;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	OTG_HS_DIEPMSK;
	volatile	uint32_t	OTG_HS_DOEPMSK;
	volatile	uint32_t	OTG_HS_DAINT;
	volatile	uint32_t	OTG_HS_DAINTMSK;
	volatile	uint32_t	RESERVED1[2];
	volatile	uint32_t	OTG_HS_DVBUSDIS;
	volatile	uint32_t	OTG_HS_DVBUSPULSE;
	volatile	uint32_t	OTG_HS_DTHRCTL;
	volatile	uint32_t	OTG_HS_DIEPEMPMSK;
	volatile	uint32_t	OTG_HS_DEACHINT;
	volatile	uint32_t	OTG_HS_DEACHINTMSK;
	volatile	uint32_t	RESERVED2[48];
	volatile	uint32_t	OTG_HS_DIEPCTL0;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	OTG_HS_DIEPINT0;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	OTG_HS_DIEPTSIZ0;
	volatile	uint32_t	OTG_HS_DIEPDMA1;
	volatile	uint32_t	OTG_HS_DTXFSTS0;
	volatile	uint32_t	RESERVED5;
	volatile	uint32_t	OTG_HS_DIEPCTL1;
	volatile	uint32_t	RESERVED6;
	volatile	uint32_t	OTG_HS_DIEPINT1;
	volatile	uint32_t	RESERVED7;
	volatile	uint32_t	OTG_HS_DIEPTSIZ1;
	volatile	uint32_t	OTG_HS_DIEPDMA2;
	volatile	uint32_t	OTG_HS_DTXFSTS1;
	volatile	uint32_t	RESERVED8;
	volatile	uint32_t	OTG_HS_DIEPCTL2;
	volatile	uint32_t	RESERVED9;
	volatile	uint32_t	OTG_HS_DIEPINT2;
	volatile	uint32_t	RESERVED10;
	volatile	uint32_t	OTG_HS_DIEPTSIZ2;
	volatile	uint32_t	OTG_HS_DIEPDMA3;
	volatile	uint32_t	OTG_HS_DTXFSTS2;
	volatile	uint32_t	RESERVED11;
	volatile	uint32_t	OTG_HS_DIEPCTL3;
	volatile	uint32_t	RESERVED12;
	volatile	uint32_t	OTG_HS_DIEPINT3;
	volatile	uint32_t	RESERVED13;
	volatile	uint32_t	OTG_HS_DIEPTSIZ3;
	volatile	uint32_t	OTG_HS_DIEPDMA4;
	volatile	uint32_t	OTG_HS_DTXFSTS3;
	volatile	uint32_t	RESERVED14;
	volatile	uint32_t	OTG_HS_DIEPCTL4;
	volatile	uint32_t	RESERVED15;
	volatile	uint32_t	OTG_HS_DIEPINT4;
	volatile	uint32_t	RESERVED16;
	volatile	uint32_t	OTG_HS_DIEPTSIZ4;
	volatile	uint32_t	OTG_HS_DIEPDMA5;
	volatile	uint32_t	OTG_HS_DTXFSTS4;
	volatile	uint32_t	RESERVED17;
		union {
	volatile	uint32_t	OTG_HS_DIEPCTL5;
	volatile	uint32_t	OTG_HS_DIEPTSIZ6;
		};
	volatile	uint32_t	OTG_HS_DTXFSTS6;
		union {
	volatile	uint32_t	OTG_HS_DIEPINT5;
	volatile	uint32_t	OTG_HS_DIEPTSIZ7;
		};
	volatile	uint32_t	OTG_HS_DTXFSTS7;
	volatile	uint32_t	OTG_HS_DIEPTSIZ5;
	volatile	uint32_t	RESERVED18;
	volatile	uint32_t	OTG_HS_DTXFSTS5;
	volatile	uint32_t	RESERVED19;
	volatile	uint32_t	OTG_HS_DIEPCTL6;
	volatile	uint32_t	RESERVED20;
	volatile	uint32_t	OTG_HS_DIEPINT6;
	volatile	uint32_t	RESERVED21[5];
	volatile	uint32_t	OTG_HS_DIEPCTL7;
	volatile	uint32_t	RESERVED22;
	volatile	uint32_t	OTG_HS_DIEPINT7;
	volatile	uint32_t	RESERVED23[69];
	volatile	uint32_t	OTG_HS_DOEPCTL0;
	volatile	uint32_t	RESERVED24;
	volatile	uint32_t	OTG_HS_DOEPINT0;
	volatile	uint32_t	RESERVED25;
	volatile	uint32_t	OTG_HS_DOEPTSIZ0;
	volatile	uint32_t	RESERVED26[3];
	volatile	uint32_t	OTG_HS_DOEPCTL1;
	volatile	uint32_t	RESERVED27;
	volatile	uint32_t	OTG_HS_DOEPINT1;
	volatile	uint32_t	RESERVED28;
	volatile	uint32_t	OTG_HS_DOEPTSIZ1;
	volatile	uint32_t	RESERVED29[3];
	volatile	uint32_t	OTG_HS_DOEPCTL2;
	volatile	uint32_t	RESERVED30;
	volatile	uint32_t	OTG_HS_DOEPINT2;
	volatile	uint32_t	RESERVED31;
	volatile	uint32_t	OTG_HS_DOEPTSIZ2;
	volatile	uint32_t	RESERVED32[3];
	volatile	uint32_t	OTG_HS_DOEPCTL3;
	volatile	uint32_t	RESERVED33;
	volatile	uint32_t	OTG_HS_DOEPINT3;
	volatile	uint32_t	RESERVED34;
	volatile	uint32_t	OTG_HS_DOEPTSIZ3;
	volatile	uint32_t	RESERVED35[3];
	volatile	uint32_t	OTG_HS_DOEPCTL4;
	volatile	uint32_t	RESERVED36;
	volatile	uint32_t	OTG_HS_DOEPINT4;
	volatile	uint32_t	RESERVED37;
	volatile	uint32_t	OTG_HS_DOEPTSIZ4;
	volatile	uint32_t	RESERVED38[3];
	volatile	uint32_t	OTG_HS_DOEPCTL5;
	volatile	uint32_t	RESERVED39;
	volatile	uint32_t	OTG_HS_DOEPINT5;
	volatile	uint32_t	RESERVED40;
	volatile	uint32_t	OTG_HS_DOEPTSIZ5;
	volatile	uint32_t	RESERVED41[3];
	volatile	uint32_t	OTG_HS_DOEPCTL6;
	volatile	uint32_t	RESERVED42;
	volatile	uint32_t	OTG_HS_DOEPINT6;
	volatile	uint32_t	RESERVED43;
	volatile	uint32_t	OTG_HS_DOEPTSIZ6;
	volatile	uint32_t	RESERVED44[3];
	volatile	uint32_t	OTG_HS_DOEPCTL7;
	volatile	uint32_t	RESERVED45;
	volatile	uint32_t	OTG_HS_DOEPINT7;
	volatile	uint32_t	RESERVED46;
	volatile	uint32_t	OTG_HS_DOEPTSIZ7;
} OTG2_HS_DEVICE_TypeDef;

#ifdef __cplusplus
#define	OTG2_HS_DEVICE	reinterpret_cast<OTG2_HS_DEVICE_TypeDef *>(0x40080800u)

#else
#define	OTG2_HS_DEVICE	((OTG2_HS_DEVICE_TypeDef *)0x40080800u)
#endif

// OTG_HS_DCFG Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL				(0x3u<<24)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_0				(0x1u<<24)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_PFIVL					(0x3u<<11)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_PFIVL_0					(0x1u<<11)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_DAD						(0x7Fu<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_DAD_0					(0x1u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK					(0x1u<<2)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_DSPD						(0x3u<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DCFG_DSPD_0					(0x1u<<0)

// OTG_HS_DCTL Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DCTL_POPRGDNE					(0x1u<<11)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_CGONAK					(0x1u<<10)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_SGONAK					(0x1u<<9)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_CGINAK					(0x1u<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_SGINAK					(0x1u<<7)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL						(0x7u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL_0					(0x1u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_GONSTS					(0x1u<<3)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_GINSTS					(0x1u<<2)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_SDIS						(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DCTL_RWUSIG					(0x1u<<0)

// OTG_HS_DSTS Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF					(0x3FFFu<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF_0					(0x1u<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DSTS_EERR						(0x1u<<3)
#define	OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD					(0x3u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_0				(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DSTS_SUSPSTS					(0x1u<<0)

// OTG_HS_DIEPMSK Configuration

