Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_device.h
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_BIM					(0x1u<<9)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM				(0x1u<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM				(0x1u<<6)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM				(0x1u<<5)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK				(0x1u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TOM					(0x1u<<3)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_EPDM					(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM					(0x1u<<0)

// OTG_HS_DOEPMSK Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_BOIM					(0x1u<<9)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OPEM					(0x1u<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP				(0x1u<<6)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM				(0x1u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_STUPM					(0x1u<<3)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_EPDM					(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM					(0x1u<<0)

// OTG_HS_DAINT Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT					(0xFFFFu<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT_0				(0x1u<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT					(0xFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT_0				(0x1u<<0)

// OTG_HS_DAINTMSK Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM					(0xFFFFu<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_0				(0x1u<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM					(0xFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_0				(0x1u<<0)

// OTG_HS_DVBUSDIS Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT				(0xFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_0				(0x1u<<0)

// OTG_HS_DVBUSPULSE Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP				(0xFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_0			(0x1u<<0)

// OTG_HS_DTHRCTL Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN					(0x1u<<27)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN				(0x1FFu<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_0			(0x1u<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN				(0x1u<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN				(0x1FFu<<2)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_0			(0x1u<<2)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN				(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN			(0x1u<<0)

// OTG_HS_DIEPEMPMSK Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM			(0xFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_0		(0x1u<<0)

// OTG_HS_DEACHINT Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT				(0x1u<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT				(0x1u<<1)

// OTG_HS_DEACHINTMSK Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM			(0x1u<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM			(0x1u<<1)

// OTG_HS_DIEPCTL0 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA				(0x1u<<31)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS				(0x1u<<30)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM				(0x1u<<29)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM		(0x1u<<28)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK					(0x1u<<27)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK					(0x1u<<26)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM				(0xFu<<22)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_0				(0x1u<<22)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_STALL				(0x1u<<21)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP				(0x3u<<18)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_0				(0x1u<<18)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS				(0x1u<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID			(0x1u<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP				(0x1u<<15)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ				(0x7FFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_0				(0x1u<<0)

// OTG_HS_DIEPINT0 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_NAK					(0x1u<<13)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_BERR					(0x1u<<12)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS			(0x1u<<11)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_BNA					(0x1u<<9)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN			(0x1u<<8)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TXFE					(0x1u<<7)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE				(0x1u<<6)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE				(0x1u<<4)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TOC					(0x1u<<3)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD				(0x1u<<1)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPINT0_XFRC					(0x1u<<0)

// OTG_HS_DIEPTSIZ0 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT				(0x3u<<19)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_0			(0x1u<<19)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ				(0x7Fu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_0			(0x1u<<0)

// OTG_HS_DIEPDMA1 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR				(0xFFFFFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_0			(0x1u<<0)

// OTG_HS_DTXFSTS0 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV			(0xFFFFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV_0			(0x1u<<0)

// OTG_HS_DIEPCTL1 Configuration

#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA				(0x1u<<31)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS				(0x1u<<30)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM				(0x1u<<29)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM		(0x1u<<28)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK					(0x1u<<27)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK					(0x1u<<26)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM				(0xFu<<22)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_0				(0x1u<<22)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_STALL				(0x1u<<21)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP				(0x3u<<18)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_0				(0x1u<<18)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS				(0x1u<<17)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID			(0x1u<<16)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP				(0x1u<<15)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ				(0x7FFu<<0)
#define	OTG2_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_0				(0x1u<<0)

